20240324T122926--kdoc-128-『goならわかるシステムプログラミング』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 128: 『Goならわかるシステムプログラミング』</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 128: 『Goならわかるシステムプログラミング』</h1>

<div id="outline-container-org5f36da7" class="outline-2">
<h2 id="org5f36da7"><a href="#org5f36da7">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org5f36da7">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-03-24 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-27 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf5b591b" class="outline-2">
<h2 id="orgf5b591b"><a href="#orgf5b591b">概要</a></h2>
<div class="outline-text-2" id="text-orgf5b591b">
<p>
<a href="https://amzn.to/3INZOjc">Goならわかるシステムプログラミング</a>はその名の通りGoで、Cを使わずにシステムプログラミングを解説した本。
</p>
</div>
</div>

<div id="outline-container-orgd25dfb9" class="outline-2">
<h2 id="orgd25dfb9"><a href="#orgd25dfb9">メモ</a></h2>
<div class="outline-text-2" id="text-orgd25dfb9">
<p>
あまりメモしてない。
</p>

<ul class="org-ul">
<li>システムコールで引数が数値なのはレジスタで渡せるのが数値だけだから</li>
<li>返り値もレジスタで返ってくるので数値</li>
<li>ソケットが他のプロセス間通信と違うのは、アドレスとポート番号がわかればローカルのコンピュータ内だけではなく外部のコンピュータとも通信が行える点</li>
<li>ソケットの3種類&#x2026;TCP, UDP, Unixドメインソケット</li>
<li id="プロセスグループ"><code>cat example.go | echo</code> パイプでつなげられたコマンドをまとめてプロセスグループという。プロセスグループに対するIDがコマンドの代表のプロセスIDとなる</li>
<li id="セッショングループ">同じターミナルから起動したアプリケーションであれば同じセッショングループ</li>
<li>すべてのプロセスは、3つの入出力データを持つ。
<ul class="org-ul">
<li>入力: コマンドライン引数</li>
<li>入力: 環境変数</li>
<li>出力: 終了コード</li>
</ul></li>
<li>プログラムから見たスレッドは、メモリにロードされたプログラムの現在の実行状態を持つ仮想CPU。仮想CPUのそれぞれにスタックメモリが割り当てられている</li>
<li>OSやCPUから見たスレッドは時間が凍結されたプログラムの実行状態</li>
<li>OSの仕事は凍結状態のプログラムの実行状態を復元して各スレッドを順番に短時間ずつ処理を再開させること</li>
<li>スレッドがCPUコアに対してマッピングされるのに対して、goroutineはOSのスレッドにマッピングされる</li>
<li>goroutineはOSスレッドの1~2MBと比べると初期スタックメモリのサイズが小さく(2KB)、起動処理が軽い</li>
</ul>
</div>
</div>
<div id="outline-container-orgcaa784a" class="outline-2">
<h2 id="orgcaa784a"><a href="#orgcaa784a">関連</a></h2>
<div class="outline-text-2" id="text-orgcaa784a">
<ul class="org-ul">
<li><a href="20240219T221805--kdoc-99-『詳解unixプログラミング』__book.html#ID-20240219T221805">KDOC 99: 『詳解UNIXプログラミング』</a>。これを読んでわけわからなかったので、より易しい本で勉強しようと考えた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
